baseWedgeCase/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/variables"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{

    left
    {
        type            zeroGradient;
    }

    right
    {
        type            fixedValue;
        value           $internalField;
    }

    noseCone
    {
        type            zeroGradient;
    }

    #include "include/wedgePatches"
}
