baseWedgeCase/0/include/fixedInlet
left
{
    type  fixedValue;
    value $internalField;
}
