baseWedgeCase/0/include/wedgePatches
front {
    type wedge;
}

back {
    type wedge;
}

top {
    type slip;
}
